{
    "data": [
        {
            "text": "Okay so uh… I already took like five trades this morning and it's not even 10am. None of them were really there but I was just… bored, you know? I keep clicking in and out, spreads are killing me but I feel like if I stop I'm gonna miss something.",
            "label": "Overtrading"
        },
        {
            "text": "Man I was up like, what, 2R on that move and I just closed it. I couldn't watch it pull back even a little. Now it's ripping without me. I hate that I do this, I just wanted the green locked in.",
            "label": "Loss_Aversion"
        },
        {
            "text": "This is such BS. That stop was perfect and it still tagged me. Whatever, screw it, I'm going back in double size. Market owes me after that garbage wick.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone on Twitter is screaming this thing is gonna moon. Like literally everyone. I don't even see the setup but if I don't ape in now I'm gonna feel like an idiot watching it rip.",
            "label": "FOMO"
        },
        {
            "text": "Okay so that's three losers in a row which means statistically the next one should hit, right? I mean it has to. I'm just gonna size up a bit and let probability do its thing.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Uh… price is kind of just chopping but I keep jumping in for these tiny scalps. I tell myself it's practice but honestly I just like being in a trade. Flat days make me itchy.",
            "label": "Overtrading"
        },
        {
            "text": "I'm still holding this red position. It's down way more than I planned but if I close it now it's real. Maybe it'll bounce back to VWAP, I just… I don't wanna take the loss.",
            "label": "Loss_Aversion"
        },
        {
            "text": "No no no, that's it, I'm pissed now. First trade rekt me, second one slipped, and now I'm slamming the buy button. I don't even care about the setup, I just need to make it back today.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Chat's going crazy about this breakout and I feel late already. I know chasing is bad but like, what if this is the one that runs all day and I'm sitting here doing nothing?",
            "label": "FOMO"
        },
        {
            "text": "I've been trading for years, I know better than this, but after all these losses it just feels like a win is due. The system wouldn't screw me this many times in a row… right?",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I said I was done for the day but I keep seeing these little moves and I'm like, oh that's tradable, that's tradable too. Next thing I know I'm on trade number nine and my P/L is basically zero.",
            "label": "Overtrading"
        },
        {
            "text": "Uh… I had my finger on the buy button and then it started moving and I froze. Now it's already up two percent. I just didn't want to be wrong again.",
            "label": "Loss_Aversion"
        },
        {
            "text": "This market is straight up rigged. Took my stop to the tick and reversed. I'm not walking away like that. I'm loading back in heavier, no stop this time.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone in Discord is already green on this trade and I'm sitting here flat. I know it's extended but I can't just watch them print while I do nothing.",
            "label": "FOMO"
        },
        {
            "text": "Four red trades… okay statistically that just doesn't make sense. The next one basically has to be a winner so I'm gonna push size a bit.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep telling myself I'm just managing risk but really I'm just clicking buttons. Even the commissions are stacking up. I'm trading just to feel active.",
            "label": "Overtrading"
        },
        {
            "text": "I moved my stop lower again. I know that's bad but if I get stopped here it'll ruin the whole week. I'll give it a little more room.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Nah I'm not calming down. That loss was personal. I'm going right back in on the same ticker. Bigger size. I don't care anymore.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This thing is all over Reddit right now. I don't even know what the company does but people are saying squeeze so… yeah I'm in.",
            "label": "FOMO"
        },
        {
            "text": "I mean eventually the odds have to flip. Losing this many times in a row just isn't normal. Next trade should balance it out.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Market's slow but I'm forcing scalps on the one-minute. Half-cent wins, half-cent losses, just nonstop clicking.",
            "label": "Overtrading"
        },
        {
            "text": "I sold way too early again. As soon as it went green I panicked and took it. Now it's doing exactly what I planned originally.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm so mad right now I can barely think. That trade wiped my morning and I'm just smashing hotkeys trying to get it back.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This breakout already happened but people are saying second leg. I don't wanna be the only one not in when it moons.",
            "label": "FOMO"
        },
        {
            "text": "After six losers there's basically no way the seventh loses too. That's just math, right? I'm going all in on this setup.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I told myself max three trades today but I'm already at seven and the day just started. I keep finding reasons to enter.",
            "label": "Overtrading"
        },
        {
            "text": "I'm watching this winner pull back and my heart's racing. I know it could go higher but I just want out before it turns red.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That's it, I'm tilted. I don't care about rules right now. I need a win and I'm gonna force one.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone keeps posting screenshots of insane gains on this ticker. I feel stupid sitting cash while they get rich.",
            "label": "FOMO"
        },
        {
            "text": "I've lost so many in a row that a win is basically guaranteed now. The market owes me one.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm not even waiting for confirmations anymore. If price twitches I jump in. Sitting on my hands feels worse than losing.",
            "label": "Overtrading"
        },
        {
            "text": "I can't hit sell. If I sell now it's a loss on the journal and I just don't want to look at that later.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I slammed that trade out of pure anger. No plan, no stop, just vibes. I need to feel like I'm fighting back.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This is already so stretched but what if it keeps running all day? I'd hate myself if I missed it.",
            "label": "FOMO"
        },
        {
            "text": "There's no way I stay unlucky forever. Probability has to even out, so this next trade is the one.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm flipping long to short to long again. Churn city. I don't even know what timeframe I'm trading anymore.",
            "label": "Overtrading"
        },
        {
            "text": "I moved my take profit closer because being up feels good and I don't want to risk giving that back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I feel personally attacked by this chart. I'm going right back in just to prove I'm right.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This ticker is trending everywhere and I feel late but not too late, right? I'm just gonna jump in now.",
            "label": "FOMO"
        },
        {
            "text": "I've paid my dues with losses. The next trade is basically destiny at this point.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Even during lunch I'm trading. No volume, bad fills, but I can't just sit here doing nothing.",
            "label": "Overtrading"
        },
        {
            "text": "I know my stop is supposed to be there but if I move it just a bit more maybe it'll survive.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That loss flipped a switch. I'm trading emotionally now and I know it but I can't stop.",
            "label": "Revenge_Trading"
        },
        {
            "text": "People are calling this the next big runner and I don't wanna be the only one who didn't buy.",
            "label": "FOMO"
        },
        {
            "text": "After all these reds the math just says green is next. I'm trusting the streak logic.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm basically scalping noise at this point. Entry, exit, entry, exit, all dopamine no edge.",
            "label": "Overtrading"
        },
        {
            "text": "I cut the trade as soon as it went green even though my target was way higher. I just couldn't relax.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm yelling at my screen and re-entering like an idiot. This is pure revenge mode.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone says this dip is a gift. I don't see it but if they're right and I skip it I'll feel dumb.",
            "label": "FOMO"
        },
        {
            "text": "There's just no way I lose eight times in a row. I'm betting big on this next one.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I closed the platform and reopened it five minutes later because I felt like I might miss a setup.",
            "label": "Overtrading"
        },
        {
            "text": "If I close this loser now it'll ruin my stats. I'll just wait a bit longer and see what happens.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I don't even care about the money right now. I just want to win this trade after that last loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This thing is already running but everyone says it's early. I don't wanna miss the real move.",
            "label": "FOMO"
        },
        {
            "text": "The universe owes me a win after today. I'm putting faith in the next trade no matter what.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep refreshing the chart like something new is gonna magically appear. Every tiny candle looks like a setup if I stare long enough, so yeah… I'm in again.",
            "label": "Overtrading"
        },
        {
            "text": "I was green and I just dumped it immediately. Didn't even let it breathe. I just really didn't want to see it turn red on me.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That loss flipped my mood instantly. I slammed another trade right after, bigger size, zero patience. I just wanna punch back.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This thing is all over StockTwits and my phone won't stop buzzing. I feel like if I don't buy now I'm gonna miss the move of the week.",
            "label": "FOMO"
        },
        {
            "text": "I've had five red days straight so tomorrow pretty much has to be green. I'm planning to size up because the streak can't last forever.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I said no trading during chop but here I am clicking in and out, getting chopped to death, just because silence feels worse.",
            "label": "Overtrading"
        },
        {
            "text": "I hovered over the sell button forever and just couldn't do it. Taking the loss feels heavier than just holding and hoping.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I know I'm tilted but I'm still trading. That last loss felt disrespectful and I'm not ending the day like that.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone keeps saying this is an easy long and I'm sitting here second-guessing. I hate being the only one not in.",
            "label": "FOMO"
        },
        {
            "text": "I've been wrong so many times that being wrong again just seems impossible. The odds have to swing back.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I don't even know what my edge is anymore. I'm just trading every five minutes because being flat makes me anxious.",
            "label": "Overtrading"
        },
        {
            "text": "As soon as it hit green I closed it. I know the plan said hold but locking profit felt safer.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That stop-out made me angry enough to re-enter without thinking. Same ticker, same bias, bigger size.",
            "label": "Revenge_Trading"
        },
        {
            "text": "People are calling this the next runner and I don't wanna explain later why I didn't buy when everyone else did.",
            "label": "FOMO"
        },
        {
            "text": "After all these small losses, the next trade basically has to be a winner. I'm trusting the numbers here.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm trading pre-market, regular hours, after hours… basically whenever there's a candle to look at.",
            "label": "Overtrading"
        },
        {
            "text": "I moved my stop again. Just a little. I can't stomach being wrong right at the bottom.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm not calm anymore. I'm clicking fast, breathing fast, just trying to undo that last hit.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This chart looks awful but everyone says it's about to explode. I feel dumb even hesitating.",
            "label": "FOMO"
        },
        {
            "text": "There's no way the system fails me this many times. Next trade should fix everything.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep telling myself it's one last trade, but then I see another tiny move and jump back in.",
            "label": "Overtrading"
        },
        {
            "text": "I didn't follow my target at all. I bailed early just so I could feel relieved for a second.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I re-entered immediately after closing the loss. Same direction, pure emotion, zero plan.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone's posting gain screenshots and I'm sitting here flat. Feels like I'm missing the party.",
            "label": "FOMO"
        },
        {
            "text": "Statistically this has gone against me too many times. The next one should finally work.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm trading out of boredom more than anything. No volume, no edge, just something to do.",
            "label": "Overtrading"
        },
        {
            "text": "I know holding losers is bad but closing it would make the day officially red. I'm not ready for that.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I feel like the market embarrassed me and now I'm trying to prove a point with this next trade.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This thing already ran but people say it's early innings. I don't wanna be late to the moon.",
            "label": "FOMO"
        },
        {
            "text": "I've earned a win after today. The streak logic says it's my turn now.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep switching timeframes and finding excuses to trade. Anything looks good if you zoom enough.",
            "label": "Overtrading"
        },
        {
            "text": "I trimmed way too early again. Watching profit evaporate scares me more than missing upside.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm fully aware this is revenge trading but I'm doing it anyway. I refuse to end on that loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This ticker is trending everywhere and I feel pressure to buy even though I don't understand it.",
            "label": "FOMO"
        },
        {
            "text": "After seven losses, probability says the next trade should hit. I'm leaning on that hard.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm basically day trading noise now. No thesis, just constant entries and exits.",
            "label": "Overtrading"
        },
        {
            "text": "I keep lowering my expectations just so I can exit green faster and feel safe.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That loss put me in attack mode. I'm firing trades just to feel in control again.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone says this dip is free money and I'm scared of being the only one who skips it.",
            "label": "FOMO"
        },
        {
            "text": "I've been on the wrong side too long. The next one has to flip, it just has to.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Even when I tell myself to stop, my hands just keep clicking. Flat feels uncomfortable.",
            "label": "Overtrading"
        },
        {
            "text": "I watched it hit my target and still sold early because I couldn't handle the pullback.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm trading angry right now. No patience, no discipline, just reacting.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This is blowing up everywhere and I feel pressure to buy just so I don't regret it later.",
            "label": "FOMO"
        },
        {
            "text": "After today, a win is basically inevitable. I'm counting on the streak to end.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I literally said out loud I was done trading and then five minutes later I'm back in because the candle looked kinda interesting.",
            "label": "Overtrading"
        },
        {
            "text": "I couldn't pull the trigger even though it was my exact setup. I just kept thinking about how bad it'd feel if it failed.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That stop-out annoyed me so much I immediately reversed and doubled size. I wasn't thinking, just reacting.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone keeps saying this is a once-in-a-month move and I'm scared I'm about to miss it sitting here.",
            "label": "FOMO"
        },
        {
            "text": "After all these losses, a win is basically due. There's no way the streak keeps going.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm taking trades just to feel busy. No real thesis, just clicking because I'm here anyway.",
            "label": "Overtrading"
        },
        {
            "text": "I sold the moment it went green even though I planned to hold. I just wanted the relief.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That loss felt disrespectful. I jumped back in immediately just to get even.",
            "label": "Revenge_Trading"
        },
        {
            "text": "People are spamming rocket emojis everywhere and I feel dumb not being in the trade.",
            "label": "FOMO"
        },
        {
            "text": "I've lost too many in a row for the next one not to work. The odds have to flip.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm trading on the one-minute, the five-minute, whatever shows movement. I just need action.",
            "label": "Overtrading"
        },
        {
            "text": "I let a winner turn into almost nothing because I was scared to re-enter if I sold.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I know this is emotional trading but I'm mad and I want it back now.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This stock is trending everywhere and I feel pressure to buy just to say I was part of it.",
            "label": "FOMO"
        },
        {
            "text": "After five red trades the math says green is next. I'm trusting probability.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm jumping in and out for pennies. Commissions are eating me alive but I can't stop.",
            "label": "Overtrading"
        },
        {
            "text": "I didn't want to close the loser because then I'd have to admit I was wrong.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That trade annoyed me enough to ignore my rules and fire another one instantly.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone says this pullback is free money and I don't wanna be the idiot who skipped it.",
            "label": "FOMO"
        },
        {
            "text": "There's no way I stay unlucky forever. The next trade should finally hit.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep saying last trade of the day and then immediately finding another excuse to enter.",
            "label": "Overtrading"
        },
        {
            "text": "I cut the trade early because watching unrealized P/L swing makes me nervous.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm re-entering the same ticker out of pure frustration. This is personal now.",
            "label": "Revenge_Trading"
        },
        {
            "text": "People are already posting gains and I feel left behind sitting in cash.",
            "label": "FOMO"
        },
        {
            "text": "After this many losses, a win feels inevitable. I'm leaning on that.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm trading through lunch even though volume is trash. Flat just feels wrong.",
            "label": "Overtrading"
        },
        {
            "text": "I moved my stop again because I couldn't handle being wrong at that level.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I slammed that order out of anger, no analysis, just vibes.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This ticker is everywhere and I feel like I'm missing the easiest money ever.",
            "label": "FOMO"
        },
        {
            "text": "Statistically the streak should end soon. The next trade should be the one.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm over-managing every candle and turning nothing into trades.",
            "label": "Overtrading"
        },
        {
            "text": "I sold early again just to avoid the stress of holding.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That loss flipped a switch and now I'm just reacting.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone's convinced this thing is going to the moon and I don't wanna miss it.",
            "label": "FOMO"
        },
        {
            "text": "I've paid my dues with losses. A win is basically owed now.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm entering trades just to feel something. No patience, no edge.",
            "label": "Overtrading"
        },
        {
            "text": "I couldn't close the loser because seeing red realized P/L hurts too much.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I revenge-clicked back into the same setup even though I knew better.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This move is already extended but what if it keeps ripping without me?",
            "label": "FOMO"
        },
        {
            "text": "After today, the next trade basically has to work. That's just how it goes.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I closed the app and reopened it because I felt like I might miss something.",
            "label": "Overtrading"
        },
        {
            "text": "I took profit way too early just to feel safe for a moment.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm trading angry and I know it. I'm just trying to undo the damage.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Everyone keeps hyping this play and I feel stupid not joining.",
            "label": "FOMO"
        },
        {
            "text": "There's no way the next trade loses too. The streak has gone on long enough.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took eight trades on the same ticker during a low-volume chop. Most entries were on minor candle breaks. Ended flat after commissions.",
            "label": "Overtrading"
        },
        {
            "text": "Entered the position late and exited quickly once it went slightly green. Price continued to trend in the original direction after exit.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered the same ticker immediately after a stop-out with increased size. Second entry ignored original risk parameters.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after a large breakout candle following heavy volume and social media attention. Entry occurred far from support.",
            "label": "FOMO"
        },
        {
            "text": "Increased position size after several consecutive losing trades, expecting the next setup to reverse results.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Multiple scalps taken on the one-minute chart without a clear higher-timeframe bias. Trades overlapped frequently.",
            "label": "Overtrading"
        },
        {
            "text": "Held a losing position beyond the planned stop level and adjusted the stop lower as price continued against the trade.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After an initial loss, executed a follow-up trade on the same setup with no confirmation and larger exposure.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered a trade after observing strong momentum and widespread trader participation despite missing the original setup.",
            "label": "FOMO"
        },
        {
            "text": "Assumed a winning trade was likely after a series of losses and committed additional capital to the next entry.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Continued trading throughout the session despite deteriorating conditions and lack of valid setups.",
            "label": "Overtrading"
        },
        {
            "text": "Exited a profitable trade early at the first pullback, well before the planned target.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Immediately reversed direction after being stopped out, using a larger position size than the initial trade.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered near the top of an extended move after observing rapid price acceleration and high participation.",
            "label": "FOMO"
        },
        {
            "text": "Justified larger risk on the next trade due to an unusually long streak of losing outcomes.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Executed repeated entries and exits within a short time window without allowing trades to develop.",
            "label": "Overtrading"
        },
        {
            "text": "Maintained a losing position as price moved further away from the original thesis, waiting for a reversal.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Took a follow-up trade shortly after a loss with minimal analysis and reduced attention to risk limits.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered after seeing continued upward momentum and widespread interest, despite poor risk-to-reward.",
            "label": "FOMO"
        },
        {
            "text": "Expected the next trade to succeed primarily because multiple previous attempts had failed.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Placed trades during periods of low volatility and unclear direction, resulting in frequent small losses.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a position prematurely to secure a small gain rather than follow the original trade plan.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered aggressively on the same instrument after a loss, abandoning prior entry criteria.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought into a move after observing strong continuation and widespread trader participation late in the trend.",
            "label": "FOMO"
        },
        {
            "text": "Increased confidence in the next trade based solely on the length of the prior losing streak.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took multiple marginal setups throughout the day instead of waiting for higher-quality opportunities.",
            "label": "Overtrading"
        },
        {
            "text": "Allowed a winning trade to turn into a loss by hesitating to exit when price reversed.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a rapid follow-up trade after a loss with little regard for confirmation or context.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered a trade after seeing repeated breakout attempts and increased chatter, despite late timing.",
            "label": "FOMO"
        },
        {
            "text": "Relied on the assumption that results would improve simply because recent trades had performed poorly.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Continued initiating trades despite reaching daily trade limits and diminishing performance.",
            "label": "Overtrading"
        },
        {
            "text": "Reduced profit targets mid-trade to ensure a positive outcome rather than allow the setup to play out.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Responded to a losing trade by increasing frequency and size of subsequent trades.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered after price had already made a significant move, driven by visible momentum and participation.",
            "label": "FOMO"
        },
        {
            "text": "Assumed probability favored a winning outcome on the next trade after a prolonged losing sequence.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Repeatedly switched bias and direction within the same session, resulting in excessive trade count.",
            "label": "Overtrading"
        },
        {
            "text": "Delayed exiting a losing trade in anticipation of a return to breakeven.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Took a new position immediately following a loss without reassessing market conditions.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered a trade after observing strong continuation moves despite missing the initial breakout.",
            "label": "FOMO"
        },
        {
            "text": "Expected the next setup to succeed primarily due to the number of recent failed trades.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Maintained constant market exposure throughout the session regardless of setup quality.",
            "label": "Overtrading"
        },
        {
            "text": "Exited trades quickly once they showed profit, even when the broader setup remained valid.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Increased aggressiveness after a loss by trading the same instrument repeatedly.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered a trade influenced by strong momentum and visible crowd participation late in the move.",
            "label": "FOMO"
        },
        {
            "text": "Placed greater confidence in the next trade based on the expectation that losses would not continue indefinitely.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Several trades were taken throughout the session without a clear primary setup. Activity remained high despite limited market movement.",
            "label": "Overtrading"
        },
        {
            "text": "A profitable position was closed early after a small pullback, even though the broader trend remained intact.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Following a loss, a new trade was placed quickly on the same instrument with increased size and reduced planning.",
            "label": "Revenge_Trading"
        },
        {
            "text": "A trade was entered after a strong price move had already occurred, with limited attention to risk-to-reward.",
            "label": "FOMO"
        },
        {
            "text": "Position size was increased after a sequence of losses, based on the expectation of an imminent win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Multiple short-term trades were executed during a low-quality market environment.",
            "label": "Overtrading"
        },
        {
            "text": "A losing position was held longer than planned while waiting for price to return toward entry.",
            "label": "Loss_Aversion"
        },
        {
            "text": "A follow-up trade was placed immediately after a loss without reassessing market structure.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entry occurred late in the move after observing continued momentum and broad participation.",
            "label": "FOMO"
        },
        {
            "text": "Confidence in the next trade was based primarily on the length of the previous losing streak.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trades were taken frequently across multiple timeframes without a consistent strategy.",
            "label": "Overtrading"
        },
        {
            "text": "Profit targets were adjusted closer mid-trade to avoid the possibility of giving back gains.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Risk limits were relaxed after a losing trade in an attempt to recover losses quickly.",
            "label": "Revenge_Trading"
        },
        {
            "text": "A position was opened after price acceleration increased, despite missing the original setup.",
            "label": "FOMO"
        },
        {
            "text": "Trade sizing decisions were influenced by the belief that recent losses made a win more likely.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "The trader remained active throughout the day despite a lack of high-quality opportunities.",
            "label": "Overtrading"
        },
        {
            "text": "A trade was exited prematurely to secure a modest gain rather than follow the original plan.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Another trade was initiated shortly after a loss with limited confirmation.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entry was made after observing strong continuation moves and widespread interest.",
            "label": "FOMO"
        },
        {
            "text": "Expectations for the next trade were shaped by the assumption that results would soon reverse.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "A high number of trades were placed during periods of sideways price action.",
            "label": "Overtrading"
        },
        {
            "text": "A winning trade was closed early once price hesitated, despite no invalidation of the setup.",
            "label": "Loss_Aversion"
        },
        {
            "text": "The same instrument was traded repeatedly after a loss with increasing aggressiveness.",
            "label": "Revenge_Trading"
        },
        {
            "text": "A trade was entered late in the trend due to visible momentum and external attention.",
            "label": "FOMO"
        },
        {
            "text": "Risk exposure increased after multiple losses under the assumption that probability favored a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trade frequency remained high even as performance deteriorated during the session.",
            "label": "Overtrading"
        },
        {
            "text": "A losing trade was maintained beyond the original exit criteria in anticipation of a rebound.",
            "label": "Loss_Aversion"
        },
        {
            "text": "A rapid re-entry followed a stop-out without sufficient analysis.",
            "label": "Revenge_Trading"
        },
        {
            "text": "A position was taken after a move had already attracted significant participation.",
            "label": "FOMO"
        },
        {
            "text": "Decision-making on the next trade relied heavily on the expectation that a streak would end.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trades were initiated continuously throughout the session regardless of setup quality.",
            "label": "Overtrading"
        },
        {
            "text": "Profit was taken quickly to avoid uncertainty, despite favorable market conditions.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Subsequent trades increased in urgency following an initial loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entry occurred after observing strong price movement and heightened trader engagement.",
            "label": "FOMO"
        },
        {
            "text": "The next trade was approached with increased confidence due to prior unsuccessful attempts.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Market exposure was maintained throughout the day with minimal time spent flat.",
            "label": "Overtrading"
        },
        {
            "text": "A position was exited early to avoid the discomfort of potential drawdown.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Trading behavior became more aggressive following a loss, with less emphasis on planning.",
            "label": "Revenge_Trading"
        },
        {
            "text": "A trade was entered based on momentum continuation rather than initial setup conditions.",
            "label": "FOMO"
        },
        {
            "text": "The assumption that outcomes would normalize influenced increased risk on the next trade.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Stayed active most of the session, taking multiple marginal setups as price moved sideways. Remaining flat felt unproductive.",
            "label": "Overtrading"
        },
        {
            "text": "Exited the trade shortly after it turned profitable, preferring to secure a small gain rather than wait through uncertainty.",
            "label": "Loss_Aversion"
        },
        {
            "text": "A second position was opened quickly after a stop-out, with noticeably higher urgency and size.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered after momentum accelerated and attention around the ticker increased, despite the move being extended.",
            "label": "FOMO"
        },
        {
            "text": "Position size was adjusted upward after a run of losses, driven by the sense that results should soon improve.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Several trades were taken back-to-back with limited pause, as waiting for clarity felt uncomfortable.",
            "label": "Overtrading"
        },
        {
            "text": "Held the position past the planned exit, giving it more room than intended as price moved against it.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Another trade was initiated immediately following a loss, with less emphasis on confirmation.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Joined the move after repeated strong candles, influenced by visible participation from other traders.",
            "label": "FOMO"
        },
        {
            "text": "Approached the next trade with increased confidence simply because several previous attempts had failed.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trade frequency remained high throughout the day, even as setups became less distinct.",
            "label": "Overtrading"
        },
        {
            "text": "Reduced the profit target mid-trade to avoid the discomfort of watching unrealized gains fluctuate.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After taking a loss, trading activity became faster and more aggressive on the same instrument.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered late in the trend after observing continued strength and growing interest around the stock.",
            "label": "FOMO"
        },
        {
            "text": "Risk assumptions on the next trade were influenced by the belief that the recent streak was unlikely to continue.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Continued initiating trades despite diminishing focus and unclear market direction.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a position early once price hesitated, prioritizing certainty over the original plan.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered the same market shortly after a loss, driven more by urgency than structure.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Took a position after noticing strong follow-through and widespread attention, even though the entry was late.",
            "label": "FOMO"
        },
        {
            "text": "Expectations for the next trade were shaped by the feeling that recent outcomes should naturally balance out.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trades were placed frequently as the session progressed, with little time spent observing without action.",
            "label": "Overtrading"
        },
        {
            "text": "Allowed a losing trade additional time in hopes that price would return closer to entry.",
            "label": "Loss_Aversion"
        },
        {
            "text": "A new trade followed a loss almost immediately, with reduced patience for ideal conditions.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered after a strong breakout once it became clear many others were participating.",
            "label": "FOMO"
        },
        {
            "text": "Increased conviction on the next setup based largely on the length of the prior losing sequence.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Maintained near-constant exposure to the market, even during periods lacking clear opportunity.",
            "label": "Overtrading"
        },
        {
            "text": "Chose to lock in a modest gain rather than stay exposed to potential pullbacks.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Trading decisions became more reactive following a loss, with faster execution and less review.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered a trade after observing continued momentum and rising interest, despite stretched conditions.",
            "label": "FOMO"
        },
        {
            "text": "Approached the next trade assuming outcomes would improve simply due to recent poor performance.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "The session involved frequent entries and exits, often before trades had time to develop.",
            "label": "Overtrading"
        },
        {
            "text": "Exited early once a trade showed profit, preferring relief over potential upside.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After a loss, additional trades were taken with a noticeable increase in urgency.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Joined a move after it gained visibility and momentum across the market.",
            "label": "FOMO"
        },
        {
            "text": "Position sizing decisions reflected the assumption that a win was due after multiple losses.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trading activity continued steadily throughout the day, even as focus and edge declined.",
            "label": "Overtrading"
        },
        {
            "text": "Delayed exiting a losing position, waiting for a more favorable price to reduce discomfort.",
            "label": "Loss_Aversion"
        },
        {
            "text": "A follow-up trade was taken quickly after a loss, with less attention to risk parameters.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered after observing strong continuation and increased participation from other traders.",
            "label": "FOMO"
        },
        {
            "text": "Kept taking small trades even though nothing really lined up. Ended the day tired and basically flat.",
            "label": "Overtrading"
        },
        {
            "text": "Took profit as soon as it turned green. Didn't want to sit through another pullback.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Got stopped out and jumped back in right after, same ticker, bigger size.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing it rip all morning and hearing everyone talk about it.",
            "label": "FOMO"
        },
        {
            "text": "Sized up on the next trade after a string of losses, felt like one had to work.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Stayed active all day even though the market was slow. Sitting out felt worse.",
            "label": "Overtrading"
        },
        {
            "text": "Cut the trade early once it hesitated, didn't want to give anything back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered fast after a loss, barely waited for confirmation.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Chased the move after it was already trending and clearly crowded.",
            "label": "FOMO"
        },
        {
            "text": "Expected the next setup to hit after too many red ones in a row.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took trade after trade without really stepping back to reassess.",
            "label": "Overtrading"
        },
        {
            "text": "Closed the position quickly just to feel some relief.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After the loss, trades got faster and less patient.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered late because it felt uncomfortable watching it run without me.",
            "label": "FOMO"
        },
        {
            "text": "Pushed more size on the next trade, thinking the streak had to end.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading even though focus was slipping.",
            "label": "Overtrading"
        },
        {
            "text": "Let the winner go early just to lock something in.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Went right back in after a stop, still annoyed about the last one.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing nonstop momentum and chatter.",
            "label": "FOMO"
        },
        {
            "text": "Felt like a win was due after everything earlier failed.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Trades kept stacking up even without clear reasons.",
            "label": "Overtrading"
        },
        {
            "text": "Held the loser longer than planned, hoping it would come back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Another trade went on immediately after a loss, no pause.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Jumped in once it was obvious everyone else was involved.",
            "label": "FOMO"
        },
        {
            "text": "Assumed probability would turn things around on the next trade.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Stayed in the market most of the session without many breaks.",
            "label": "Overtrading"
        },
        {
            "text": "Took a small win instead of waiting through uncertainty.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Trading felt rushed after the first loss of the day.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Entered once the move felt obvious and hard to ignore.",
            "label": "FOMO"
        },
        {
            "text": "Believed the next trade would fix the day after earlier losses.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept clicking in and out without letting trades breathe.",
            "label": "Overtrading"
        },
        {
            "text": "Exited early just to avoid watching price swing.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-traded the same name after a loss, still heated.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after seeing nonstop green candles.",
            "label": "FOMO"
        },
        {
            "text": "Sized up because it felt like losses had gone on long enough.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept taking trade after trade today even though nothing really looked perfect. Each setup was small, but I felt like if I didn't do something I'd miss the chance to make a few pips here or there, and sitting on the sidelines was driving me crazy.",
            "label": "Overtrading"
        },
        {
            "text": "I closed my position way too early even though the trend was still intact. I just didn't want to see it go red again and lose the small gains I had already locked in.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After getting stopped out, I jumped back in immediately on the same ticker, and I even increased my position size. I knew it was impulsive, but I felt like I had to get that money back before the market moved on me.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I entered late on the breakout because everyone on social was talking about it. Even though the candle had already run far, I felt like if I didn't get in now I'd be missing out on the next leg.",
            "label": "FOMO"
        },
        {
            "text": "After a string of losses, I sized up on the next trade. My logic was that I was due for a win and that one trade could make up for the money I lost earlier in the day.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I stayed in front of the screen for hours taking small trades on almost nothing. I knew the setups weren't perfect, but I hated feeling like I wasn't doing something productive with my day.",
            "label": "Overtrading"
        },
        {
            "text": "I let a trade run for longer than I planned because I was hoping it would come back. Even though my plan said to cut it, I just couldn't face realizing the loss yet.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Right after a small loss, I entered another trade on the same stock, bigger than the first. I told myself it made sense because I could fix the loss immediately, even though I knew I wasn't thinking clearly.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I bought into a strong move that had already run up because everyone was talking about it and I didn't want to feel left out. I know the price was high, but the fear of missing out overpowered the setup.",
            "label": "FOMO"
        },
        {
            "text": "I increased my risk on the next trade after a few losses, reasoning that statistically a win had to happen soon. I felt like if I didn't act, the losing streak would continue and I'd never recover.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept scalping small moves across multiple charts even though nothing really screamed a strong setup. I kept thinking that any small edge could add up if I just kept trading.",
            "label": "Overtrading"
        },
        {
            "text": "I sold a trade after just a minor gain, even though my original target was much higher. I kept worrying it could turn against me and didn't want to give any of it back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After a loss, I immediately placed another trade on the same ticker. I knew it wasn't ideal, but I wanted to even things out quickly and it felt urgent.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I entered a trade after seeing momentum pick up and the stock trending everywhere online. Even though the setup wasn't clean, I felt like I had to get in before the move went too far.",
            "label": "FOMO"
        },
        {
            "text": "I assumed the next trade would work after losing multiple trades in a row. My logic was that I was overdue for a win, so I felt justified taking more risk.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept taking trades all day, hopping in on setups that were far from perfect. Even though I knew it was reckless, the idea of missing any move made me keep clicking.",
            "label": "Overtrading"
        },
        {
            "text": "I exited a winning position too early because I didn't want the stress of seeing it pull back. Even though my plan said to hold, the uncertainty made me sell.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I re-entered the same market immediately after a stop-out with bigger size. I knew it was emotionally driven, but I wanted to fix the loss and couldn't wait.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I bought into a strong trend after seeing it everywhere on social and news. Even though it was late in the move, I felt like not joining would make me miss the next jump.",
            "label": "FOMO"
        },
        {
            "text": "I added more to a trade after several losing attempts. I told myself the odds had to flip and that I couldn't keep losing forever.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept scalping tiny moves all morning even though setups were weak; sitting idle felt worse than risking a small loss.",
            "label": "Overtrading"
        },
        {
            "text": "I sold the trade after a small pop even though it was trending; I didn't want to see the green turn back to red.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After being stopped out, I jumped back in bigger than before; I felt like I had to win that back immediately.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late because everyone online was bullish; I didn't want to miss what looked like a big run.",
            "label": "FOMO"
        },
        {
            "text": "Increased my size after three losses; I convinced myself I was due for a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept clicking in and out on small setups; doing nothing felt like wasted time.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a winning trade too early; I just couldn't handle watching it dip.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a follow-up trade right after a loss with no plan; I just wanted to fix the last one.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing a strong breakout and chatter everywhere; the fear of missing out was stronger than logic.",
            "label": "FOMO"
        },
        {
            "text": "Doubled down after multiple losses, thinking the next trade had to pay off eventually.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took multiple trades on tiny moves while waiting for a proper setup; sitting idle felt boring.",
            "label": "Overtrading"
        },
        {
            "text": "I exited a trade as soon as it ticked up; I was worried I'd give it back if I held.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After a losing streak, I went back into the same stock bigger; I knew it was emotional but felt I needed to recover.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Jumped in after noticing heavy momentum and lots of chatter; I didn't want to miss the next leg up.",
            "label": "FOMO"
        },
        {
            "text": "Added more risk after a few losses; I convinced myself luck had to change.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading even when setups weren't clean; sitting out felt like I'd be missing out on pips.",
            "label": "Overtrading"
        },
        {
            "text": "Took profit very early; I didn't want to see a good trade turn bad.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered the same stock immediately after a loss; urgency drove the trade more than logic.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after a long run; I knew it was extended but couldn't stand being left behind.",
            "label": "FOMO"
        },
        {
            "text": "Bumped up my position size after a losing streak, thinking the next one had to hit.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept jumping between charts and trades all day, even when conditions weren't good.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a winner quickly just to lock in gains; I didn't trust the market to stay kind.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After a stop-out, I jumped back in without proper planning; I just wanted to get even.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Joined a crowded trade late; seeing everyone else in made me feel like I had to act.",
            "label": "FOMO"
        },
        {
            "text": "Increased my risk after a string of losses; I assumed a win had to happen soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept trading small moves all session; doing nothing felt wrong even if setups were weak.",
            "label": "Overtrading"
        },
        {
            "text": "Took profit early on a good move; I just couldn't stomach watching unrealized gains fluctuate.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed another trade immediately after a loss; impatience and frustration drove the decision.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after a breakout with everyone talking about it; I felt pressure to be part of the move.",
            "label": "FOMO"
        },
        {
            "text": "Added more to a trade after losing multiple times; it felt like I was due for a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Scalped repeatedly throughout the session even though setups weren't ideal; sitting idle felt wasted.",
            "label": "Overtrading"
        },
        {
            "text": "Exited a winner quickly to avoid potential pullback; I felt uneasy holding it longer.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered immediately after a loss; I just wanted to get it back before the market moved.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought a crowded trade late in the run; the fear of missing out overrode my rules.",
            "label": "FOMO"
        },
        {
            "text": "Took a larger position after consecutive losses, hoping the streak would reverse.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading all morning without waiting for proper setups; doing nothing made me anxious.",
            "label": "Overtrading"
        },
        {
            "text": "Closed the position for a small gain rather than let it swing; I didn't trust it to hold.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Jumped into another trade right after a loss; I wanted revenge more than a calculated plan.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after momentum pushed higher and chatter increased; I didn't want to miss the move.",
            "label": "FOMO"
        },
        {
            "text": "Increased trade size after several losses, thinking a win was bound to happen soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept entering multiple trades all session even when conditions were choppy; staying idle felt worse.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a winning trade too early; I didn't want to risk giving anything back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a trade immediately after a loss; urgency and frustration made me act before analyzing.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after seeing everyone pile in; fear of missing out was stronger than the setup.",
            "label": "FOMO"
        },
        {
            "text": "Took bigger risk after losing streak; I felt a win was due soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept flipping trades across charts, even though nothing looked strong; felt like I had to do something.",
            "label": "Overtrading"
        },
        {
            "text": "Exited early to lock in a profit; uncertainty made me act before plan completion.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered another trade immediately after losing; wanted to make up the money fast.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing strong continuation and chatter online; late entry, but FOMO kicked in.",
            "label": "FOMO"
        },
        {
            "text": "Added to a position after multiple losing trades; felt like I was due for a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept trading all day; even weak setups felt better than staying flat.",
            "label": "Overtrading"
        },
        {
            "text": "Took profit early on a green move; I didn't want to risk losing it back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered after a stop-out; I just wanted to fix the loss before moving on.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Jumped in after a big move everyone was talking about; I didn't want to be left out.",
            "label": "FOMO"
        },
        {
            "text": "Increased size after consecutive losses; I felt the next trade had to succeed.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Scalped repeatedly even though setups weren't strong; being idle made me anxious.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a winner early to avoid stress; couldn't trust it to stay up.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a trade immediately after a loss; emotional reaction was stronger than analysis.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late in a trend after seeing high volume and chatter; FOMO won over rules.",
            "label": "FOMO"
        },
        {
            "text": "Added more risk after losing trades; felt like a win was overdue.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading all morning; weak setups felt better than sitting idle.",
            "label": "Overtrading"
        },
        {
            "text": "Sold early to lock in gains; didn't want to risk a reversal.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered another trade immediately after a loss; urgency outweighed careful analysis.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late on a strong move; didn't want to miss the trend despite risk.",
            "label": "FOMO"
        },
        {
            "text": "Increased size after multiple losses; I felt a win had to happen.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I kept taking trades even without strong setups; doing nothing felt worse than risking a small loss.",
            "label": "Overtrading"
        },
        {
            "text": "Exited a trade quickly to secure profit; couldn't handle unrealized swings.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered immediately after a loss; wanted to recover fast rather than wait.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after momentum and chatter picked up; fear of missing out made me act.",
            "label": "FOMO"
        },
        {
            "text": "Took bigger risk after a streak of losses; assumed probability was on my side.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Scalped repeatedly without waiting for quality setups; felt better than doing nothing.",
            "label": "Overtrading"
        },
        {
            "text": "Closed the trade early to avoid losing paper profits; discomfort made me exit.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a follow-up trade immediately after a loss; emotions overrode caution.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late in a trending stock after seeing everyone pile in; FOMO drove the entry.",
            "label": "FOMO"
        },
        {
            "text": "Added more to the position after multiple losses; felt like a win was due soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading weak setups all morning; staying idle made me anxious.",
            "label": "Overtrading"
        },
        {
            "text": "Sold early to lock in gains; didn't want to risk giving back profits.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered immediately after a loss; urgency outweighed logical setup evaluation.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after noticing a strong move and chatter; fear of missing out kicked in.",
            "label": "FOMO"
        },
        {
            "text": "Increased position size after a string of losses; assumed I was due for a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Repeated small trades all session even though setups weren't ideal; doing nothing felt worse.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a profitable trade too soon; I didn't trust the market to keep it going.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a trade right after a stop-out; wanted to recover the loss immediately.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing a clear momentum move and social chatter; late entry but didn't want to miss out.",
            "label": "FOMO"
        },
        {
            "text": "Took a larger position after multiple losses; believed the next trade was likely to succeed.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Made a few trades on small moves, nothing too serious, just trying to stay active.",
            "label": "Overtrading"
        },
        {
            "text": "Closed the position after a small gain; didn't stick around to see how it developed.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Jumped back in after taking a small loss; the next trade went in faster than usual.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after noticing a lot of chatter online; the move was already underway.",
            "label": "FOMO"
        },
        {
            "text": "Placed a bigger trade after a few losses; hoping this one would work out.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took several small trades throughout the session; just trying to catch something.",
            "label": "Overtrading"
        },
        {
            "text": "Exited early when it turned profitable; didn't want to risk giving anything back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered another trade right after a stop-out; didn't think much, just went for it.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing the price run; didn't want to sit on the sidelines.",
            "label": "FOMO"
        },
        {
            "text": "Added to a position after a losing streak; hoping it would turn around this time.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading throughout the day, even when setups weren't clear.",
            "label": "Overtrading"
        },
        {
            "text": "Took profit quickly; didn't hold to see if it would move further.",
            "label": "Loss_Aversion"
        },
        {
            "text": "After a loss, another trade was opened immediately; size was a bit larger than usual.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought a stock that was moving up fast; it seemed like everyone was in already.",
            "label": "FOMO"
        },
        {
            "text": "Increased risk after several losing trades; felt like one had to work soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took multiple trades in a row; didn't wait for clear setups.",
            "label": "Overtrading"
        },
        {
            "text": "Closed the trade early; I wanted to lock in the small profit.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered the same market after a loss; decision was quick and impulsive.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after noticing momentum; seemed like the move wasn't stopping yet.",
            "label": "FOMO"
        },
        {
            "text": "Added to a losing trade; hoping the next move would be positive.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept flipping trades throughout the session; just trying to catch small moves.",
            "label": "Overtrading"
        },
        {
            "text": "Sold a position after minor gains; didn't wait for the target to be reached.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered another trade immediately after a small loss; reaction was quick, almost automatic.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought a stock after seeing it run; it felt like the move was too good to ignore.",
            "label": "FOMO"
        },
        {
            "text": "Placed a larger trade after a string of losses; assumed it would pay off soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Traded more than usual; setups weren't strong but I kept going anyway.",
            "label": "Overtrading"
        },
        {
            "text": "Took a small win and exited; didn't stay in for the bigger move.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a trade quickly after a loss; wanted to recover fast.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after noticing lots of volume; entry was late but seemed necessary.",
            "label": "FOMO"
        },
        {
            "text": "Added to a position after losses; hoping the next one would be profitable.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading weak setups; sitting idle didn't feel right.",
            "label": "Overtrading"
        },
        {
            "text": "Closed early to secure gains; didn't want to risk a reversal.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered the same market after a loss; reaction was fast and emotional.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late in a trending stock; felt like I had to be part of the move.",
            "label": "FOMO"
        },
        {
            "text": "Placed a larger trade after losing streak; hoping for a positive turn.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took trades throughout the session; setups weren't clear but kept going.",
            "label": "Overtrading"
        },
        {
            "text": "Sold a winner early; didn't wait for the trade to develop fully.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed another trade right after a stop-out; acted fast without much thought.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing momentum and chatter online; entry was late but I joined anyway.",
            "label": "FOMO"
        },
        {
            "text": "Added to a losing position; felt like the next trade had to work.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading even with weak setups; doing nothing felt worse.",
            "label": "Overtrading"
        },
        {
            "text": "Exited a trade early for small profit; didn't want to risk reversal.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered after a loss; acted quickly, not thinking much.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after seeing the stock run; FOMO pushed me in.",
            "label": "FOMO"
        },
        {
            "text": "Took bigger size after consecutive losses; hoping to turn things around.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Traded multiple small setups; felt like doing something was better than nothing.",
            "label": "Overtrading"
        },
        {
            "text": "Sold a winning trade early; didn't trust it to hold.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed a trade immediately after a stop; emotional response to the loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late in a trending move; entry wasn't ideal but felt necessary.",
            "label": "FOMO"
        },
        {
            "text": "Added more to a losing trade; assumed next one would work.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Kept trading all day; setups were unclear but kept going anyway.",
            "label": "Overtrading"
        },
        {
            "text": "Took small profits early; didn't want to risk losing them.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Entered another trade immediately after a loss; reaction was quick and automatic.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought a stock after seeing momentum and chatter; felt like I had to join.",
            "label": "FOMO"
        },
        {
            "text": "Placed a bigger trade after several losses; hoping for a reversal.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Took a series of trades with weak setups; sitting idle felt wrong.",
            "label": "Overtrading"
        },
        {
            "text": "Closed a profitable trade early; didn't stay in for bigger gains.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Re-entered after a loss; quick reaction rather than careful analysis.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought late after seeing volume pick up; felt like I had to get in.",
            "label": "FOMO"
        },
        {
            "text": "Added to a losing position; expecting the next trade to be positive.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Traded multiple small moves; doing nothing felt worse than risking small losses.",
            "label": "Overtrading"
        },
        {
            "text": "Sold early to lock in profit; didn't want to see it turn against me.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Placed another trade immediately after a stop; wanted to recover fast.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Bought after seeing momentum and chatter; late entry but joined anyway.",
            "label": "FOMO"
        },
        {
            "text": "Added to a losing position; hoped the next trade would work out.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "This stock I've been buying has been going down so much, so I'm doubling back because surely it's gonna go back up.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I've been staring at charts for an hour and I'm bored. This range is tight so I'm just going to take a quick scalp even though there's no real signal.",
            "label": "Overtrading"
        },
        {
            "text": "Nothing is clean today but I feel like I should be doing something. I'll just take a small trade to stay sharp.",
            "label": "Overtrading"
        },
        {
            "text": "I keep switching tickers because I don't want to miss any movement. Every time I see a candle pop I jump in.",
            "label": "Overtrading"
        },
        {
            "text": "I'm down a little on the day and I keep taking random setups to 'work my way back' instead of waiting for A+ entries.",
            "label": "Overtrading"
        },
        {
            "text": "I told myself only two trades, but I keep finding micro-reasons to enter. I feel uncomfortable just watching.",
            "label": "Overtrading"
        },
        {
            "text": "My watchlist is quiet so I'm trading whatever moves. It's basically entertainment at this point.",
            "label": "Overtrading"
        },
        {
            "text": "I'm taking tiny trades on the one-minute because I want action. I'm not even sure what my plan is anymore.",
            "label": "Overtrading"
        },
        {
            "text": "I'm clicking in and out because I hate being flat. Even if the R/R isn't great, at least I'm doing something.",
            "label": "Overtrading"
        },
        {
            "text": "I missed the morning move so now I'm forcing trades to 'make the day worth it.'",
            "label": "Overtrading"
        },
        {
            "text": "This is a low-volume midday chop but I keep trading it like it's open. I just can't sit still.",
            "label": "Overtrading"
        },
        {
            "text": "I took three trades on the same tiny pattern because I thought repetition would make it work eventually.",
            "label": "Overtrading"
        },
        {
            "text": "Every time price wiggles I treat it like a setup. I'm basically manufacturing trades.",
            "label": "Overtrading"
        },
        {
            "text": "I keep refreshing the chart and taking entries before my alerts even trigger. I'm impatient and overactive.",
            "label": "Overtrading"
        },
        {
            "text": "I'm trading because I'm at my desk anyway. It feels weird to not 'use the time' even without an edge.",
            "label": "Overtrading"
        },
        {
            "text": "I'm up small today so I'm just taking more trades to keep the momentum going, even though it's getting sloppy.",
            "label": "Overtrading"
        },
        {
            "text": "I'm up a little and I want to lock it in. I don't care if it hits the full target, I just want guaranteed green.",
            "label": "Loss_Aversion"
        },
        {
            "text": "It finally turned green and I hit sell immediately. I couldn't handle the thought of it going red again.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm still holding this loser because closing it would make it real. I'd rather wait and hope it comes back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I moved my stop lower because getting stopped would hurt more than being wrong slowly.",
            "label": "Loss_Aversion"
        },
        {
            "text": "Price pulled back a bit and I bailed even though nothing broke. I just didn't want to watch profit shrink.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I cut my winner at the first sign of hesitation. I'd rather take a small win than risk being disappointed.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm down but I can't sell here. I'll wait for breakeven because taking the loss feels like admitting failure.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I reduced my target mid-trade. I know it's worse expectancy, but I wanted the relief of 'banking' something.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm watching unrealized P/L swing and it stresses me out, so I keep exiting early the moment it's green.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I keep telling myself it'll bounce back to my entry so I don't have to take the loss.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I didn't take the stop because I thought, 'it's already down, what's another few cents?'",
            "label": "Loss_Aversion"
        },
        {
            "text": "I won't close the trade because it would ruin my win rate. I'd rather hold longer and see if it recovers.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I got scared of giving back gains, so I took profit way too early and now it's running without me.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I hesitated to exit the loser because I hate seeing realized red in the journal.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm trailing my stop super tight because I can't tolerate a pullback, even if it means I'll get shaken out.",
            "label": "Loss_Aversion"
        },
        {
            "text": "That stop-out made me mad. I'm re-entering right now with bigger size to get it back.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I don't even care about the setup anymore. I just need to make back what I lost on the last trade.",
            "label": "Revenge_Trading"
        },
        {
            "text": "The market disrespected me with that wick. I'm going back in immediately to prove I'm right.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm tilted. I just hit the hotkeys without thinking because I refuse to end the session down.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I lost on this ticker and now I'm obsessed with it. I'm trading it again until it pays me back.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I sized up after the loss because I want one trade to erase the damage.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I got stopped out and immediately flipped direction out of anger. No analysis, just impulse.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm not walking away after that. I'm going to take another shot right now, bigger, just to get even.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm trading fast and emotional. I know it's dumb, but I want a win immediately after that loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm ignoring my daily max loss because I'm convinced the next trade will 'fix it.'",
            "label": "Revenge_Trading"
        },
        {
            "text": "I re-entered the same setup instantly because I felt embarrassed by the stop-out.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm basically fighting the chart right now. I'm taking trades just to feel in control again.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I just doubled size because I'm angry. If it works, I'm back. If it doesn't, whatever.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I'm chasing a quick win after that loss. I'm not thinking about edge, only recovery.",
            "label": "Revenge_Trading"
        },
        {
            "text": "That loss made me slam another entry immediately. I didn't even check levels—just hit buy.",
            "label": "Revenge_Trading"
        },
        {
            "text": "This ticker is trending everywhere and I feel like I'll regret it if I'm not in.",
            "label": "FOMO"
        },
        {
            "text": "Everyone in my group chat is already long. I don't see a perfect setup, but I'm entering anyway.",
            "label": "FOMO"
        },
        {
            "text": "It's ripping and I feel late. I'm jumping in now because I can't stand watching it go without me.",
            "label": "FOMO"
        },
        {
            "text": "Twitter is full of screenshots on this move. I don't want to be the only one who missed it.",
            "label": "FOMO"
        },
        {
            "text": "I'm buying even though it's extended because people keep saying 'this is just the start.'",
            "label": "FOMO"
        },
        {
            "text": "I missed the initial breakout but it keeps going. I'm entering because I don't want to miss the second leg.",
            "label": "FOMO"
        },
        {
            "text": "Everyone's calling this 'the trade of the day' and I feel pressure to participate.",
            "label": "FOMO"
        },
        {
            "text": "I don't know the fundamentals here, but the hype is massive. I'm in because it's moving.",
            "label": "FOMO"
        },
        {
            "text": "I know chasing is bad but it feels worse to sit out while the whole market watches this thing run.",
            "label": "FOMO"
        },
        {
            "text": "It's already up a lot, but the comments keep saying squeeze. I'd hate myself if it doubles without me.",
            "label": "FOMO"
        },
        {
            "text": "Everyone is posting profits and I'm flat. I'm buying just to not feel left behind.",
            "label": "FOMO"
        },
        {
            "text": "This is on every scanner and I'm scared I'll miss the move of the week if I don't enter now.",
            "label": "FOMO"
        },
        {
            "text": "I hesitated earlier and now it's higher. I'm entering late because I feel like I already 'missed' enough.",
            "label": "FOMO"
        },
        {
            "text": "The candle is huge and I'm late, but I'm still buying because it looks like it won't stop.",
            "label": "FOMO"
        },
        {
            "text": "I'm taking this trade because everyone else seems convinced. I don't want to be the idiot on the sidelines.",
            "label": "FOMO"
        },
        {
            "text": "I've had four losers, so the next one has to win. I'm going to size up because the streak can't continue.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm due for a winner. Probability has to even out, so I'm taking this next setup bigger.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "There's no way I lose again after this many red trades. I'm betting heavier on the next entry.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I've been wrong all morning, so statistically I should be right soon. I'm trusting the numbers.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "After five losing days, tomorrow basically has to be green. I'm planning to push size.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I keep thinking, 'it can't keep failing.' So I'm taking another trade because the odds should flip.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm on a losing streak, which means a win is coming soon. I'm going to press this one.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I've taken this setup three times and lost, but it can't lose forever. The next one should work.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm increasing size because I feel like I've 'paid' enough in losses to earn a win.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I know it's not how markets work, but it feels impossible to keep losing. Next trade should balance it.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "This system has failed me too many times in a row—so it's basically guaranteed to hit soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm thinking the streak has to end. I'm taking the next signal no matter what because it's 'due.'",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm down today, but that just means I'm more likely to win the next one. I'm leaning on that logic.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I lost six times—there's basically no way the seventh loses. I'm going bigger on this next trade.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I'm not unlucky forever. The probability has to swing back, so this is the trade that turns it around.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I missed the early move on this AI stock, but the whole sector is heating up. I'm going to rotate into another name in the same space and catch the next wave.",
            "label": "FOMO"
        },
        {
            "text": "Everyone at work has been talking about this ticker all week. It feels like the kind of stock you just have to own while it's popular.",
            "label": "FOMO"
        },
        {
            "text": "Bonus season just hit and there's a lot more money flowing into the market. I feel like that should push prices higher, so I'm getting more aggressive with trades.",
            "label": "FOMO"
        },
        {
            "text": "This stock already ran, but the news cycle around it is still strong. I think there's more upside just from attention alone.",
            "label": "FOMO"
        },
        {
            "text": "I missed the breakout on the main name, so I'm buying one of its smaller competitors. If the theme keeps running, it should follow.",
            "label": "FOMO"
        },
        {
            "text": "Retail traders are piling into anything related to this sector. I don't want to overthink it—I'll just go where the crowd is.",
            "label": "FOMO"
        },
        {
            "text": "The whole market is talking about rate cuts again. Feels like risk-on conditions, so I'm taking more trades than usual.",
            "label": "Overtrading"
        },
        {
            "text": "Since I'm working from home today, I've got the charts open all day. I'll probably take more trades than usual just because I'm around.",
            "label": "Overtrading"
        },
        {
            "text": "Market's been really active lately and I don't want to miss any moves, so I'm watching multiple tickers and jumping in whenever something starts moving.",
            "label": "Overtrading"
        },
        {
            "text": "There's a lot of economic news this week, so I feel like I should stay active in the market instead of sitting out.",
            "label": "Overtrading"
        },
        {
            "text": "I've got some extra cash this month and the market's been volatile, so I'm trading more often to take advantage of it.",
            "label": "Overtrading"
        },
        {
            "text": "The last trade didn't work, but the sector still looks strong. I'm going to try again on a similar setup.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I got stopped out of that move, but the story hasn't changed. I'm jumping back in because I think the market overreacted.",
            "label": "Revenge_Trading"
        },
        {
            "text": "That earnings reaction didn't make sense to me. I'm buying again because I feel like the market got it wrong.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I lost money on the first breakout attempt, but the narrative is still strong, so I'm taking another shot at it.",
            "label": "Revenge_Trading"
        },
        {
            "text": "The trade failed earlier, but I still believe in the idea. I'm entering again with a bit more size.",
            "label": "Revenge_Trading"
        },
        {
            "text": "I sold too early on the last run, so I'm not letting this one slip away. I'll just hold through the noise.",
            "label": "Loss_Aversion"
        },
        {
            "text": "This trade is slightly red, but with the positive news around the company, I'm willing to give it more room.",
            "label": "Loss_Aversion"
        },
        {
            "text": "The setup hasn't completely invalidated, so I'm holding even though it's below my planned stop.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I'm still green on the week, so I'd rather just close this trade now than risk giving those gains back.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I don't want this trade to turn into a loss, especially after the good start I had this morning, so I'm taking profit early.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I've had a few losing trades on this type of setup, so the next one should work if I stick with it.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "This strategy hasn't paid off all week, which probably means it's about to start working again.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I've been wrong on this sector three times, but the trend is still up, so odds are the next trade finally hits.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "After a red day like yesterday, today should naturally be better. I'm trading a bit bigger.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "The last few breakouts failed, but statistically one of them has to follow through soon.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Tech has been weak for days, so it feels like it's due for a bounce. I'm positioning for that.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "Crypto's been red all week, which usually means a green day is coming. I'm buying the dip.",
            "label": "Gamblers_Fallacy"
        },
        {
            "text": "I missed the morning move, so I'm trying to catch a similar setup in a related stock this afternoon.",
            "label": "FOMO"
        },
        {
            "text": "This one looks like yesterday's runner before it took off. I'm entering early so I don't miss the same move twice.",
            "label": "FOMO"
        },
        {
            "text": "The market's been rewarding these types of plays all week, so I'm just following the same pattern.",
            "label": "FOMO"
        },
        {
            "text": "People keep talking about how much money is in options right now, so I'm trading more aggressively to keep up.",
            "label": "Overtrading"
        },
        {
            "text": "There's so much volatility lately that it feels wrong to sit out. I'm taking more trades just to stay involved.",
            "label": "Overtrading"
        },
        {
            "text": "Since the market's been moving fast, I feel like I need to stay active all session instead of waiting for perfect setups.",
            "label": "Overtrading"
        },
        {
            "text": "This stock is down, but the broader theme is still hot. I'll hold and give it time to catch up.",
            "label": "Loss_Aversion"
        },
        {
            "text": "The trade is barely green, but with all the uncertainty in the market, I'd rather just lock it in now.",
            "label": "Loss_Aversion"
        },
        {
            "text": "I got stopped out earlier, so I'm taking another shot at a similar setup to make back the loss.",
            "label": "Revenge_Trading"
        },
        {
            "text": "That trade didn't work, but the narrative is still strong. I'm re-entering because the idea makes sense.",
            "label": "Revenge_Trading"
        },
        {
            "text": "Retail sentiment is extremely bullish right now, so I'm jumping into anything getting attention.",
            "label": "FOMO"
        },
        {
            "text": "There's a lot of hype around this earnings season, so I'm trading more names than usual.",
            "label": "Overtrading"
        },
        {
            "text": "I better sell early to cut early the loss. I can accept a 2% loss.",
            "label": "Loss_Aversion"
        }
    ]
}